---
kind: method
id: M:Autodesk.Revit.Exceptions.OutdatedDirectlyOpenedCentralException.GetObjectData(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
source: html/493ce60f-0a0f-6c7e-4b74-1e794bfb19fa.htm
---
# Autodesk.Revit.Exceptions.OutdatedDirectlyOpenedCentralException.GetObjectData Method

Retrieves data needed to serialize the target object.

## Syntax (C#)
```csharp
public override void GetObjectData(
	SerializationInfo info,
	StreamingContext context
)
```

## Parameters
- **info** (`System.Runtime.Serialization.SerializationInfo`) - Data needed to serialize or deserialize the object.
- **context** (`System.Runtime.Serialization.StreamingContext`) - The destination of the serialized stream.